// Constants
import { serviceTypes } from "./serviceTypes";

export const complexGuidelines = complexId => {
  switch (complexId) {
    // מחנה פלוגות
    case 1:
    case 3:
      return (
        <>
          <u>נהלי התנהגות במתחם המשותף:</u>
          <ol>
            <li>מתחם העבודה הוא משותף – יש להתחשב במשתמשים האחרים, בדגש הקפדה על שקט.</li>
            <li>בעת ההגעה והעזיבה יש לעדכן את אחראי המתחם.</li>
            <li>יש לפנות את העמדה בתום הזמן שהוקצה.</li>
            <li>חל איסור על אכילה ושתייה ליד עמדות המחשב. ניתן לשתות בפינת הקפה.</li>
            <li>בסיום העבודה יש להשאיר עמדה נקייה ומסודרת.</li>
            <li>יש להקפיד על הוראות ב"מ (אין לצאת מהמחנה עם חומר סודי).</li>
            <li>יש לשמור על הציוד האישי.</li>
            <li>אין להשאיר חומר בעמדות ללא השגחה.</li>
            <li>יש לשמור על הציוד שהועמד לרשותך.</li>
            <li>בכל מקרה חריג (עמדה לא תקינה, בעיית חשמל, תקלת בינוי וכו') יש לעדכן מיד את אחראי המתחם.</li>
          </ol>
        </>
      );
    // אכא
    case 2:
      return (
        <>
          <u>נהלי התנהגות במתחם המשותף:</u>
          <ol>
            <li>מתחם העבודה הוא משותף – יש להתחשב במשתמשים האחרים, בדגש הקפדה על שקט.</li>
            <li>בעת ההגעה והעזיבה יש לעדכן את אחראי המתחם.</li>
            <li>יש לפנות את העמדה בתום הזמן שהוקצה.</li>
            <li>חל איסור על אכילה ושתייה ליד עמדות המחשב. ניתן לשתות בפינת הקפה.</li>
            <li>בסיום העבודה יש להשאיר עמדה נקייה ומסודרת.</li>
            <li>
              יש להקפיד על הוראות ב"מ (אין לצאת מהמחנה עם חומר סודי):
              <dt>א. הקפידו על מידור.</dt>
              <dt>ב. אין להשאיר מידע מסווג ללא השגחה.</dt>
              <dt>ג. אין לחבר למחשב ציוד שאיננו מאושר (בדגש על טלפונים סלולארים, dok וכו').</dt>
              <dt>ד. בסיום העבודה, יש להתנתק מהחשבון האישי.</dt>
            </li>
            <li>יש לשמור על הציוד האישי.</li>
            <li>אין להשאיר חומר בעמדות ללא השגחה.</li>
            <li>יש לשמור על הציוד שהועמד לרשותך.</li>
            <li>בכל מקרה חריג (עמדה לא תקינה, בעיית חשמל, תקלת בינוי וכו') יש לעדכן מיד את אחראי המתחם.</li>
            <li>
              <b>
                יש לשמור על זמינות בערב שלפני תאריך ההזמנה, יצרו עמך קשר ממפקדת מכלול ג'למה על מנת לקחת פרטים
                לצורך אישור כניסה למחנה.
              </b>
            </li>
          </ol>
        </>
      );

    default:
      return (
        <>
          <u>נהלי התנהגות במתחם המשותף:</u>
          <ol>
            <li>מתחם העבודה הוא משותף – יש להתחשב במשתמשים האחרים, בדגש הקפדה על שקט.</li>
            <li>בעת ההגעה והעזיבה יש לעדכן את אחראי המתחם.</li>
            <li>יש לפנות את העמדה בתום הזמן שהוקצה.</li>
            <li>חל איסור על אכילה ושתייה ליד עמדות המחשב. ניתן לשתות בפינת הקפה.</li>
            <li>בסיום העבודה יש להשאיר עמדה נקייה ומסודרת.</li>
            <li>יש להקפיד על הוראות ב"מ (אין לצאת מהמחנה עם חומר סודי).</li>
            <li>יש לשמור על הציוד האישי.</li>
            <li>אין להשאיר חומר בעמדות ללא השגחה.</li>
            <li>יש לשמור על הציוד שהועמד לרשותך.</li>
            <li>בכל מקרה חריג (עמדה לא תקינה, בעיית חשמל, תקלת בינוי וכו') יש לעדכן מיד את אחראי המתחם.</li>
          </ol>
        </>
      );
  }
};

export const entryPermitsGuidelines = serviceType => {
  let textWalk = "";
  let textVehicle = "";

  if (serviceTypes.HOVA.includes(serviceType) || serviceTypes.KEVA.includes(serviceType)) {
    textWalk = "בהצגת תעודת חוגר/קצין.";
    textVehicle = "באישור מפקדת מחנה תל השומר.";
  } else if (serviceTypes.MILOEEM.includes(serviceType)) {
    textWalk = 'עד דרגת סא"ל כולל – בהצגת תעודת מילואים וצו מילואים פעיל.';
    textVehicle =
      'בהצגת תעודת מילואים וצו מילואים פעיל, באישור מפקדת מחנה תל השומר, מדרגת תא"ל – בהצגת תעודת מילואים.';
  } else {
    textWalk = 'בהצגת תעודת עובד צה"ל.';
  }

  return (
    <>
      <u>אישור כניסה למחנה תל השומר:</u>
      <ol>
        <li>המתחם נמצא מול הכוורת בבסיס.</li>
        {textWalk !== "" && <li>אישור כניסה רגלי - {textWalk}</li>}
        {textVehicle !== "" && <li>אישור כניסה רכוב - {textVehicle}</li>}
      </ol>
    </>
  );
};
